# GO DIG IQ
# PYTHON
* Pattern codes
* small string codes
* Higher order Function
* map , resdce , filter
* List comprehension
* Dictionary comprehension
* OOPS in python

In [2]:
pip install pandasql

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: numpy in c:\users\amruta marne\anaconda3\lib\site-packages (from pandasql) (1.21.5)
Requirement already satisfied: pandas in c:\users\amruta marne\anaconda3\lib\site-packages (from pandasql) (1.4.4)
Requirement already satisfied: sqlalchemy in c:\users\amruta marne\anaconda3\lib\site-packages (from pandasql) (1.4.39)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\amruta marne\anaconda3\lib\site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\amruta marne\anaconda3\lib\site-packages (from pandas->pandasql) (2022.1)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\amruta marne\anaconda3\lib\site-packages (from sqlalchemy->pandasql) (1.1.1)
Requirement already satisfied: six>=1.5 in c:\users\amruta marne\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas->pandasql) (1.16.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py): started
  Building wheel for pandasql (setup.py): finished with status 'done'
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26768 sha256=c778193abc30d50063b6ca4fd65da28c3992bc077933d0a75a80a6c29b37aa4c
  Stored in directory: c:\users\amruta marne\appdata\local\pip\cache\wheels\63\e8\ec\75b1df467ecf57b6ececb32cb16f4e86697cbfe55cb0c51f07
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

In [2]:
from pandasql import sqldf

In [4]:
drinks = pd.read_csv(r"C:\Users\amruta marne\Desktop\OffCampus\Company_Questions\Go_digital\Drinks (4).csv")

In [5]:
drinks.head()

   Unnamed: 0       Drink_Name  Quantity continent
0           0    beer_servings      1630        AS
1           1  spirit_servings      2677        AS
2           2    wine_servings       399        AS
3           3    beer_servings      8720        EU
4           4  spirit_servings      5965        EU

In [7]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  15 non-null     int64
 1   Drink_Name  15 non-null     object
 2   Quantity    15 non-null     int64
 3   continent   15 non-null     object
dtypes: int64(2), object(2)
memory usage: 608.0+ bytes

In [8]:
sqldf("select * from drinks")

    Unnamed: 0       Drink_Name  Quantity continent
0            0    beer_servings      1630        AS
1            1  spirit_servings      2677        AS
2            2    wine_servings       399        AS
3            3    beer_servings      8720        EU
4            4  spirit_servings      5965        EU
5            5    wine_servings      6400        EU
6            6    beer_servings      3258        AF
7            7  spirit_servings       866        AF
8            8    wine_servings       862        AF
9           12    beer_servings      2101        SA
10          13  spirit_servings      1377        SA
11          14    wine_servings       749        SA
12          15    beer_servings      1435        OC
13          16  spirit_servings       935        OC
14          17    wine_servings       570        OC

# Q1

In [56]:
#Q1) can you tell me how much beer is served in asia 
sqldf("select continent, sum(Quantity) as beer_served_in_Asia from drinks where continent = 'AS' and  Drink_Name = 'beer_servings' ")

  continent  beer_served_in_Asia
0        AS                 1630

# Q2

In [6]:
#Q2) What is the number of drinks served across each continent
sqldf("select continent, sum(Quantity) as beer_served_AcrossEach_Continent from drinks group by continent ")

  continent  beer_served_AcrossEach_Continent
0        AF                              4986
1        AS                              4706
2        EU                             21085
3        OC                              2940
4        SA                              4227

# Q3

In [81]:
sqldf("select * from (select Drink_Name ,quantity,continent as second_highest_serving  ,  \
      dense_rank() over( partition by Drink_Name order by Quantity desc)rank  from drinks) ")

         Drink_Name  quantity second_highest_serving  rank
0     beer_servings      8720                     EU     1
1     beer_servings      3258                     AF     2
2     beer_servings      2101                     SA     3
3     beer_servings      1630                     AS     4
4     beer_servings      1435                     OC     5
5   spirit_servings      5965                     EU     1
6   spirit_servings      2677                     AS     2
7   spirit_servings      1377                     SA     3
8   spirit_servings       935                     OC     4
9   spirit_servings       866                     AF     5
10    wine_servings      6400                     EU     1
11    wine_servings       862                     AF     2
12    wine_servings       749                     SA     3
13    wine_servings       570                     OC     4
14    wine_servings       399                     AS     5

# Q 3 Ans

In [80]:
#Q3) can you tell me 2nd Highest country(continent) name for beer , spirit and wine serving ?
sqldf("select * from (select Drink_Name ,quantity,continent as second_highest_serving  ,  \
      dense_rank() over( partition by Drink_Name order by Quantity desc)rank  from drinks) where rank= 2  ")

        Drink_Name  quantity second_highest_serving  rank
0    beer_servings      3258                     AF     2
1  spirit_servings      2677                     AS     2
2    wine_servings       862                     AF     2

# Q4

In [72]:
# Q4) Which continent has most beer servings compared to spirit servings
sqldf("select Drink_Name,Quantity,continent from drinks ")

         Drink_Name  Quantity continent
0     beer_servings      1630        AS
1   spirit_servings      2677        AS
2     wine_servings       399        AS
3     beer_servings      8720        EU
4   spirit_servings      5965        EU
5     wine_servings      6400        EU
6     beer_servings      3258        AF
7   spirit_servings       866        AF
8     wine_servings       862        AF
9     beer_servings      2101        SA
10  spirit_servings      1377        SA
11    wine_servings       749        SA
12    beer_servings      1435        OC
13  spirit_servings       935        OC
14    wine_servings       570        OC

# Cumulative Sum

In [83]:
# select sal,sum(sal) over(order by unique_col) as cum from table
sqldf("select Drink_name,Quantity,rank , sum(quantity) over(order by rank) as cumulative from \
    (select * , row_number() over(order by quantity ) rank from drinks)")

         Drink_Name  Quantity  rank  cumulative
0     wine_servings       399     1         399
1     wine_servings       570     2         969
2     wine_servings       749     3        1718
3     wine_servings       862     4        2580
4   spirit_servings       866     5        3446
5   spirit_servings       935     6        4381
6   spirit_servings      1377     7        5758
7     beer_servings      1435     8        7193
8     beer_servings      1630     9        8823
9     beer_servings      2101    10       10924
10  spirit_servings      2677    11       13601
11    beer_servings      3258    12       16859
12  spirit_servings      5965    13       22824
13    wine_servings      6400    14       29224
14    beer_servings      8720    15       37944

In [13]:
# Using Self join let see 
# SELECT t1.id, t1.value, SUM(t2.value) AS cumulative_sum
# FROM my_table t1
# INNER JOIN my_table t2 ON t2.id <= t1.id
# GROUP BY t1.id, t1.value
# ORDER BY t1.id;

sqldf(" select t1.rank,t1.quantity,sum(t2.quantity) as cumulative_sum from \
        (select * , row_number() over(order by quantity ) rank from drinks ) t1 \
        inner join (select * , row_number() over(order by quantity ) rank from drinks ) t2 on t2.rank <= t1.rank \
        group by t1.rank, t1.quantity \
        order by t1.rank")

    rank  Quantity  cumulative_sum
0      1       399             399
1      2       570             969
2      3       749            1718
3      4       862            2580
4      5       866            3446
5      6       935            4381
6      7      1377            5758
7      8      1435            7193
8      9      1630            8823
9     10      2101           10924
10    11      2677           13601
11    12      3258           16859
12    13      5965           22824
13    14      6400           29224
14    15      8720           37944

In [147]:
# Q4) Which continent has most beer servings compared to spirit servings
sqldf("select continent as continent_hasMost_beer_servings_compared_to_spirit_servings from\
      (select * from drinks where Drink_Name = 'beer_servings')d \
       where d.quantity > (select quantity from drinks where drink_name ='spirit_servings'\
       and d.continent = continent) ")

  continent_hasMost_beer_servings_compared_to_spirit_servings
0                                                 EU
1                                                 AF
2                                                 SA
3                                                 OC

# Q5

In [20]:
#Q5)if beer price is 100 spirit price is 70 ans wine price is 150 which continent having 3rd lowest revenue
sqldf(" select * from ( select continent, sum(revenue) as third_lowest from \
      ( select *, case when Drink_Name like 'beer_servings' then 100*quantity\
                      when Drink_Name like 'spirit_servings' then 70*quantity\
                      when Drink_Name like 'wine_servings' then 150*quantity\
                 end as revenue\
      from (select *, case when drinks.Drink_Name like 'beer_servings' then 100 \
                      when drinks.Drink_Name like 'spirit_servings' then 70 \
                      when drinks.Drink_Name like 'wine_servings' then 150 \
                      end as rate_   from drinks)) group by continent order by sum(revenue))  limit 1 offset 2  ")

  continent  third_lowest
0        SA        418840

In [51]:
sqldf("select continent,total_revenue,rank_ from (select *,dense_rank() over( order by total_revenue ) rank_  from \
                     (select *,sum(revenue) as total_revenue from \
                     (select *, case when Drink_Name like 'beer_servings' then 100*quantity\
                      when Drink_Name like 'spirit_servings' then 70*quantity\
                      when Drink_Name like 'wine_servings' then 150*quantity\
                 end as revenue\
      from (select *, case when drinks.Drink_Name like 'beer_servings' then 100 \
                      when drinks.Drink_Name like 'spirit_servings' then 70 \
                      when drinks.Drink_Name like 'wine_servings' then 150 \
                      end as rate_   from drinks)) group by continent order by total_revenue)) where rank_ =3  ")

  continent  total_revenue  rank_
0        SA         418840      3

In [58]:
sqldf("select continent,total_revenue,rank_ from (select *,dense_rank() over( order by total_revenue ) rank_  from \
                     (select *,sum(revenue) as total_revenue from \
                     (select *, case when Drink_Name like 'beer_servings' then 100*quantity\
                      when Drink_Name like 'spirit_servings' then 70*quantity\
                      when Drink_Name like 'wine_servings' then 150*quantity\
                 end as revenue\
      from drinks) group by continent order by total_revenue)) where rank_ =3  ")

  continent  total_revenue  rank_
0        SA         418840      3

# PYTHON

In [105]:
a = [1,3,5,7,9]
b = [8,6,4,2,0]

In [106]:
data_frame = pd.DataFrame(list(zip(a, b)),
               columns =['A', 'B'])

In [107]:
data_frame.head()

   A  B
0  1  8
1  3  6
2  5  4
3  7  2
4  9  0

In [108]:
data_frame.columns

Index(['A', 'B'], dtype='object')

In [178]:
print(len(a))

5

In [179]:
output=[]
for i in range(len(a)):
    output.append(0)
    
print(output)

[0, 0, 0, 0, 0]

In [180]:
for i in range(len(a)):
    if a[i]>b[i]:
        output[i]=1
        break    
print(output)

[0, 0, 1, 0, 0]

In [181]:
data_frame = pd.DataFrame(list(zip(a, b,output)),
               columns =['A', 'B','Output'])
print(dataframe)

   A  B  Output
0  1  8       0
1  3  6       0
2  5  4       1
3  7  2       0
4  9  0       0

In [182]:
sqldf("select *, case when A < B then 0\
                     when A < 1.3*B then 1\
                     else 0\
                     end as 'sql_output' from data_frame")

   A  B  Output  sql_output
0  1  8       0           0
1  3  6       0           0
2  5  4       1           1
3  7  2       0           0
4  9  0       0           0

In [120]:
# select sal,sum(sal) over(order by unique_col) as cum from table
n=7
k=1
left = n//2+1
right = n//2+1
for i in range(n//2+1):
    for j in range(n+1):
        if j>=left and j<=right:
            print(k,end=" ")
            k=k+1
        else:
            print(" ",end=" ")
    left = left-1
    right= right+1
    k=1
    print()

        1
      1 2 3
    1 2 3 4 5
  1 2 3 4 5 6 7

In [2]:
# for i in range(1, 6):
#     for j in range(i):
#         print(j+1, end='')
#     print()
    
n = 5
for i in range(1, n+1):
    for j in range(n-i):
        print(" ", end="")
    for k in range(1, i+1):
        print(k, end=" ")
    print()

    1
   1 2
  1 2 3
 1 2 3 4
1 2 3 4 5

In [101]:
a = 'abcdef'
b=[]
for i in range(len(a)-1,-1,-1):
    b.append(a[i])
    
print(b)
c = ''.join(b)
print(c)

['f', 'e', 'd', 'c', 'b', 'a']
fedcba

In [96]:
a = ['c','d','a','b']
a.sort()
print(a)

['a', 'b', 'c', 'd']

In [18]:
string = "dcba"
# st = string.split()
print(st)
st1=[]
for i in range(len(string)-1,-1,-1):
    st1.append(string[i])
    
print(st1)
st2=''.join(st1)
print(st2)

['dcba']
['a', 'b', 'c', 'd']
abcd

In [98]:
string = "hi how are you"
st = string.split()
st.reverse()
print(st)
st2 = ' '.join(st)
print(st2)

['you', 'are', 'how', 'hi']
you are how hi

In [112]:
list = [[1,2,3],[4,5,6],[7,8,9]]

In [116]:
# m = max(max(i) for i in list)
# print(m)

m = 0
for i in list:
    for j in range(len(i)): #range(a,b) means a inckude but b exclude and b-1 taken
        if i[j] > m:
            m = i[j]
            
print(m)

9

In [7]:
n =5
space = 2*n
for i in range(1,n+1):
    s = i*'* '
    print(s.center(space,' '))

    *
   * *
  * * *
 * * * *
* * * * *

In [26]:
n = 5 
space = 2*n
for i in range(n,0,-1):
    s = i*'* '
    print(s.ljust(space,' '))

* * * * *
* * * *
* * *
* *
*

In [118]:
n = 5 
space = 2*n
for i in range(0,n+1):
    s = i*' *'
    print(s.rjust(space,' '))

         *
       * *
     * * *
   * * * *
 * * * * *

In [50]:
a = 'a'
b = 'b'
a=ord('a')
b=ord('b')
a = a + b
b = a - b
a = a - b 
a = chr(a)
b = chr(b)
print("a =",a ,"B =",b)

a = b B = a

## High Order Function

In [3]:
def r_s(func,L):
    result = 0
    
    for i in L:
        if func(i):
            result=result+i
        
    return result
    
L = [11,14,21,23,56,78,45,29,28]

x = lambda x : x%2 == 0 
y = lambda y : y%2 != 0 
z = lambda z : z%3 == 0 

print("Sum of even numbers-",r_s(x,L))
print("Sum of odd numbers-",r_s(y,L))
print("Sum of numbers divisible by 3 -",r_s(z,L))

Sum of even numbers- 176
Sum of odd numbers- 129
Sum of numbers divisible by 3 - 144

# Map,filter and reduce
* Map: returns an array of pieces of information from the original array. In the callback function, return the data you wish to be part of the new array.
* Filter: returns a subset of the original array based on custom criteria.

## map

In [2]:
L = [1,2,3,4,5,6,7,8,9]
list(map(lambda x : x*2,L))

[2, 4, 6, 8, 10, 12, 14, 16, 18]

In [3]:
L1 = L = [1,2,3,4,5,6,7,8,9]
list(map(lambda x: True if x%2 == 0 else False,L1))

[False, True, False, True, False, True, False, True, False]

In [5]:
students = [
    {"name":"a",
    "add":"Chennai"},{
    "name":"b",
    "add":"mumbai"
    }
]
print(students)

[{'name': 'a', 'add': 'Chennai'}, {'name': 'b', 'add': 'mumbai'}]

In [6]:
list(map(lambda student: student['name'],students))

['a', 'b']

## filter

In [21]:
L = [1,2,3,4,5,6,7]
list(map(lambda x : x>4,L))

[False, False, False, False, True, True, True]

In [22]:
list(filter(lambda x : x>4,L))

[5, 6, 7]

In [23]:
fruits = ['apple','mango','orange','guava']

In [24]:
list(filter(lambda x: 'e' in x,fruits))

['apple', 'orange']

## reduce

In [8]:
import functools

In [9]:
L = [4,7,6,3,8,1]
functools.reduce(lambda x,y:x+y,L)

29

In [10]:
# finding max from list
L = [45,89,63,74,58,99,11]
print("biggest number from list is :",functools.reduce(lambda x,y : x if x > y else y,L))

biggest number from list is : 99

In [33]:
# finding samll from list
L = [45,89,63,74,58,99,11]
print("smallest number from list is :",functools.reduce(lambda x,y : x if x < y else y,L))

smallest number from list is : 11

## List comprehension
* List comprehension is an elegant way to define and create lists based on existing lists. List comprehension is generally more compact and faster than normal functions and loops for creating list.

In [39]:
L = [45,89,63,74,58,99,11]

L1 = [item*2 for item in L]
print(L1)

[90, 178, 126, 148, 116, 198, 22]

In [41]:
L2 = [i**2 for i in range(10)]
L2

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

In [67]:
fruits = ['apple','mango','orange','guava']

L3 = [f for f in fruits if f[0] == 'a']
L3

['apple']

## Dictionary comprehension

In [70]:
D = {"name":"Nitesh","Age":48,"Gender":"male"}
D

{'name': 'Nitesh', 'Age': 48, 'Gender': 'male'}

In [71]:
D.items() # gives list of tuples

dict_values(['Nitesh', 48, 'male'])

In [72]:
D.keys() # give list of keys

dict_keys(['name', 'Age', 'Gender'])

In [74]:
D.values() # give list of values

dict_values(['Nitesh', 48, 'male'])

In [79]:
D1 = {key:value for key,value in D.items() if len(key)> 3}
D1

{'name': 'Nitesh', 'Gender': 'male'}

In [85]:
L = [1,2,3,4,5,6]

D2 ={item:item**2 for item in L}
print(D2)
D3 ={item:item**2 for item in L if item%2 == 0}
D3

{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36}

{2: 4, 4: 16, 6: 36}

# OOPS in PYTHON

In [103]:
class Computer:
    def __init__(self,cpu1,ram1):
        self.cpu = cpu1
        self.ram = ram1
        
    def config(self):
        print("Class name is :",type(comp1).__name__)
        print("Config is :",self.cpu,'',self.ram,' GB')
        print("Class name is :",self.__class__.__name__)
        print('')
        
        
comp1 = Computer("i5",16)
comp2 = Computer("Ryzen", 8)

comp1.config()
comp2.config()

# you can not write name of object

Class name is : Computer
Config is : i5  16  GB
Class name is : Computer

Class name is : Computer
Config is : Ryzen  8  GB
Class name is : Computer

In [105]:
print('Address of comp1 object :',id(comp1),'\n')
print('Address of comp2 object :',id(comp2),'\n')

Address of comp1 object : 1562557460288

Address of comp2 object : 1562557348064

In [110]:
# x = 6
# # if else in one line
# True if x > 5 else False
x = 6
# if else in one line
"good" if x > 5 else "Bad"

'good'

In [111]:
class Car:
    wheels = 5
    
    def __init__(self):
        self.name = "BMW"
        self.mil = 10
        

c1 = Car()
c2 = Car()
c1.mil = 8
Car.wheels = 4

print(c1.name,c1.mil,Car.wheels)

BMW 8 4

## Types of variavbles and methods

### Variable
* 1) Instance variable  (eg. self.a = 23)
* 2) Static/Class variable (eg. b = 23)

## Methods
* 1) Instatnce methods(a. accessors b. mutators) {eg. def sum(self,a,b):  }
* 2) Class methods {eg. def get_name(cls):  } 
* 3) Instance methods {eg. def info():  }

In [ ]:
class Student:
    school = "CDAC"
    
    def __init__(self,m1,m2,m3): # instance method or Constructor
        self.m1 = m1
        self.m2 = m2
        self.m3 = m3
        
    def avg(self): # instance method 
        return (self.m1 +self.m2 + self.m3)/3
    
    def get_m1(self): # instance method or setter or accessor
        return self.m1
    
    def set_m1(self,value): # instance method or getter or mutator
        self.m1 = value
        
    @classmethod # decorator
    def getSchool(cls):  # Class Method
        return cls.school
    
    @staticmethod # decorator
    def info(): # static method
        print("This is student class")

In [28]:
s1 = Student(34,47,32)
s2 = Student(48,47,49)

In [33]:
print(round(s1.avg(),2))
print(Student.getSchool()) # for accessing class methods you can use classname.class_method_name
Student.info() # # for static class methods you can  use classname.static_method_name
Student.getSchool()

37.67
CDAC
This is student class

In [35]:
s1.getSchool()

'CDAC'

## Class Inside Class

In [39]:
class Student:
    
    def __init__(self,name,roll_no):
        self.name = name
        self.roll_no = roll_no
        self.lap = self.Laptop() # type 1 of creating object from inner class
        
    def show(self):
        print(self.name,self.roll_no)
        self.lap.show()
        
    class Laptop:
        def __init__(self):
            self.brand = "HP"
            self.cpu = "i5"
            
        def show(self):
            print(self.brand,self.cpu)

In [40]:
s1 = Student("Navi",32)
s2 = Student("Daniel",49)

In [41]:
s1.show()

Navi 32
HP i5

In [43]:
 # type 2 of creating object from inner class
lap1 = Student.Laptop()
lap2 = Student.Laptop()
# creating two differnet object by second method
print(id(lap1))
print(id(lap2))

2097385171072
2097392485664

## Inheritance in python

* multilevel inheritance

In [56]:
class A:
    def f1(self):
        print("F1 working")
        
    def f2(self):
        print("F2 working")
        
        
class B(A):
    def f3(self):
        print("F3 working")
        
    def f4(self):
        print("F4 working")
        
class C(B):
    def f5(self):
        print("F5 working")
        

a1= A()    
b1 = B()
c1 = C()

In [55]:
a1.f1()
a1.f2()

F1 working
F2 working

In [53]:
b1.f1()
b1.f3()

F1 working
F3 working

In [57]:
c1.f1()

F1 working

* multiple inheritance

In [59]:
class D:
    def f1(self):
        print("F1 working")
        
    def f2(self):
        print("F2 working")
        
        
class E():
    def f3(self):
        print("F3 working")
        
    def f4(self):
        print("F4 working")
        
class F(D,E):
    def f5(self):
        print("F5 working")
        
d1 = D()
e1 = E()
f1 = F()

In [61]:
d1.f1()

F1 working

In [62]:
e1.f3()

F3 working

In [64]:
f1.f1()
f1.f3()
f1.f5()

F1 working
F3 working
F5 working

* constructor in Inheritance

In [89]:
# by default if child class not have __init__ constructor method it will call __init__ method of parent class 
# by default if child class have __init__ constructor method it will call __init__ method of it's own class 

class A:
    
    def __init__(self):
        print("In a init of class A \n")
        
    
    def f1(self):
        print("F1 working")
        
    def f2(self):
        print("F2 working")
        
        
class B():
    
    def __init__(self):
        # super().__init__()
        print("In a init of class B \n")
    
    def f1(self):
        print("F3 working")
        
    def f4(self):
        print("F4 working")
        
class C(A,B):
    def __init__(self):
        super().__init__()
        print("In a init of class C")
    
    def f5(self):
        # you can use super keyword to call other methods also
        super().f2()
        print("F5 working")
        
a1 = A()
b1 = B()
# method resolution order(M.R.O.)
c1 = C() # always call from left to right

In a init of class A

In a init of class B

In a init of class A

In a init of class C

In [87]:

a1.f1()
b1.f1()

F1 working
F3 working

In [90]:
c1.f5()

F2 working
F5 working

* Duck Typing

In [93]:
class Pycharm:
    def execute(self):
        print("compiling")
        
        
class MyEditor:
    def execute(self):
        print("compiling")       
        print("Running")
        
class Laptop:
    def code(self,ide):
        ide.execute()
        
ide = Pycharm()

lap1 = Laptop()

In [94]:
lap1.code(ide)

compiling

* operator overloading

In [99]:
a = 5
b = 6
print(a+b)# when you call a+b
print(int.__add__(a,b))# behind the scenes it happens

a = 'a'
b = 'b'
print(a+b)
print(str.__add__(a,b)) # magic methods

11
11
ab
ab

In [127]:
class Students:
    
    def __init__(self,m1,m2):
        self.m1=m1
        self.m2=m2
        
    def __add__(self,other):
        m1 = self.m1 + other.m1
        m2 = self.m2 + other.m2
        s3=Students(m1,m2)
        return s3
    
    def __gt__(self,other):
        r1 = self.m1 + self.m2
        r2 = other.m1+ other.m2
        if r1>r2:
            return True
        else:
            False
            
        def __str__(self):
            return '{} {} ' .format(self.m1,self.m2)
        
s1 = Students(58,59)
s2 = Students(60,65)  

s3 = s1+s2
print(s3.m2)

if s1 > s2:
    print("S1 wins")  
else:
    print("s2 wins")
    
print(s1)
print(s1.__str__())
print(s2)

124
s2 wins
<__main__.Students object at 0x000001E855D43160>
<__main__.Students object at 0x000001E855D43160>
<__main__.Students object at 0x000001E855D43A30>

* method overloading   (same method name, different parameters,same class) does not support by python

### Method overriding

* Same method name , same parameter , different class

In [133]:
class A:
    def show(self):
        print("In A show")
        
class B(A):
    def show(self):
        print("in B show")
      

a1 = B()
a1.show()

# show method of class B overrides the show method of class A

in B show